package art;
/**
 * 메인 화면에 사용할 아스키 아트를 모아놓은 클래스입니다.
 * 
 * @author 정재은(gitHub.com/ThereIsGrace)
 * @version 1.0.1
 */
public class AsciiArt {
	/*
	 * 안내 문구를 입력할 때 사용하는 아스키 아트입니다.
	 */
	public static void cuteRabbit() {
		System.out.println(" /) /)");
		System.out.println("(｡･-･) 💕⁾⁾");	
	}
	
	/*
	 * 브랜드 로고를 나타내는 아스키 아트입니다.
	 */
	public static void logo() {
		System.out.println("/\\__  _\\  /\\ \\ ");
		System.out.println("\\/_/\\ \\/  \\ \\ \\___     _ __     __      __    __  __     __        __       ___  ");
		System.out.println("   \\ \\ \\   \\ \\  _ `\\  /\\`'__\\ /'__`\\  /'__`\\ /\\ \\/\\ \\  /'__`\\    /'_ `\\    / __`\\ ");
		System.out.println("    \\ \\ \\   \\ \\ \\ \\ \\ \\ \\ \\/ /\\  __/ /\\  __/ \\ \\ \\_/ |/\\ \\L\\.\\_ /\\ \\L\\ \\  /\\ \\L\\ \\");
		System.out.println("     \\ \\_\\   \\ \\_\\ \\_\\ \\ \\_\\ \\ \\____\\\\ \\____\\ \\ \\___/ \\ \\__/.\\_\\\\ \\____ \\ \\ \\____/");
		System.out.println("      \\/_/    \\/_/\\/_/  \\/_/  \\/____/ \\/____/  \\/__/   \\/__/\\/_/ \\/___L\\ \\ \\/___/ ");
		System.out.println("                                                                   /\\____/        ");
		System.out.println("                                                                   \\_/__/         ");
	}
	
	/*
	 * 로그인에 성공했을 때 나타나는 아스키 아트입니다.
	 */
	public static void loginSuccess() {
		System.out.println("₊⁺·₊˚♡˚₊·⁺₊₊⁺·₊˚♡˚₊·⁺₊\r\n"
				+ ". ᘏ▸◂ᘏ ╭◜◝ ◜◝ ◜◝╮\r\n"
				+ "꒰ ɞ̴̶̷ ·̮  로그인 성공 ꒱\r\n"
				+ "( つ旦O ╰◟◞ ◟◞ ◟◞╯\r\n"
				+ "₊⁺·₊˚♡˚₊·⁺₊₊⁺·₊˚♡˚₊·⁺₊\r\n"
				+ "");
	}
}
